perf/exchange.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5

scenarios:
  - name: Exchange (/exchange)
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 9991
            counterAccountId: 9992
            baseAmount: 100
      - post:
          url: '/exchange'
          json:
            baseCurrency: "USD"
            counterCurrency: "EUR"
            baseAccountId: 9992
            counterAccountId: 9993
            baseAmount: 10