perf/mixed.yaml
config:
  environments:
    baseline:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      phases:
        - name: Baseline
          duration: 180
          arrivalRate: 1

    load:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      phases:
        - name: Ramp
          duration: 120
          arrivalRate: 1
          rampTo: 20
        - name: Sostenido
          duration: 300
          arrivalRate: 20

    stress:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      phases:
        - name: "10 rps"
          duration: 120
          arrivalRate: 10
        - name: "25 rps"
          duration: 120
          arrivalRate: 25
        - name: "50 rps"
          duration: 120
          arrivalRate: 50
        - name: "100 rps"
          duration: 120
          arrivalRate: 100

  pool: 50

# Perfil de tráfico mixto realista:
# 60% lecturas de rates, 30% exchanges, 5% accounts, 5% log
scenarios:
  - name: GET /rates
    weight: 60
    flow:
      - get:
          url: '/rates'

  - name: POST /exchange
    weight: 30
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 100

  - name: GET /accounts
    weight: 5
    flow:
      - get:
          url: '/accounts'

  - name: GET /log
    weight: 5
    flow:
      - get:
          url: '/log'